EDT/МПСтриж/src/InformationRegisters/ПрикрепленныеФайлы/ПрикрепленныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрикрепленныеФайлы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Данные</name>
    <type>
      <types>CatalogRef.ПрикрепленныеФайлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/Catalogs/ПрикрепленныеФайлы/ПрикрепленныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрикрепленныеФайлы</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипыПрикрепленныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереданНаСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачиНаСервер</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/МПСтриж/src/Catalogs/ТипыПрикрепленныхДокументов/ТипыПрикрепленныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыПрикрепленныхДокументов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Заборы</name>
      <description>Заборы</description>
      </content>
    </items>
    <items>
      <name>Заказы</name>
      <description>Заказы</description>
      </content>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ДоступенВыборВМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксИмениФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КачествоФото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерноБелоеФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтметкаНаФотоснимке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступностьПоТипамЗаказов</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/МПСтриж/src/CommonModules/ФотографированиеСервер/Module.bsl
&НаСервере
Функция ЗаписатьДанныеФайла(Значение, Документ, Заказ, ТипДокумента, Расширение, ТипСодержимого = "") Экспорт
	Хр = Новый ХранилищеЗначения(Значение, Новый СжатиеДанных(9));
	
	СпрФайл = Справочники.ПрикрепленныеФайлы.СоздатьЭлемент();
	СпрФайл.Данные = Хр;
	СпрФайл.РасширениеДокумента = Расширение;
	СпрФайл.ТипДокумента = ТипДокумента;
	СпрФайл.ДатаСоздания = ТекущаяДата();
	ИмяФ = "";
	Если ЗначениеЗаполнено(ТипДокумента.ПрефиксИмениФайла) Тогда
		ИмяФ = СокрЛП(ТипДокумента.ПрефиксИмениФайла);
	Иначе	
		ИмяФ = "foto_ma";
	КонецеСли;	
	
	ИмяФ = ИмяФ + "_" + СокрЛП(Заказ.Номер) + "_" + Формат(День(СпрФайл.ДатаСоздания), "ЧЦ=2; ЧН=; ЧВН=") + "_" + Формат(Месяц(СпрФайл.ДатаСоздания), "ЧЦ=2; ЧН=; ЧВН=") + "_" + Формат(Год(СпрФайл.ДатаСоздания), "ЧЦ=4; ЧН=; ЧВН=; ЧГ=0");
	
	СпрФайл.Наименование = ИмяФ;
	
	СпрФайл.Записать();
	
	ТекВр = ТекущаяДата();
	
	Наб = РегистрыСведений.ПрикрепленныеФайлы.СоздатьНаборЗаписей();
	Наб.Отбор.Документ.Установить(Документ);
	Наб.Отбор.Заказ.Установить(Заказ);   
	Наб.Отбор.Период.Установить(ТекВр);
	
	Нов = Наб.Добавить();
	
	Нов.Период = ТекВр;
	Нов.Документ = Документ;
	Нов.Заказ = Заказ;
	Нов.Данные = СпрФайл.Ссылка;
	
	Наб.Записать();
	Возврат Истина;
КонецФункции

Функция ПолучитьТипыПрикрепленныхДокументов(Заказ) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ТипыПрикрепленныхДокументов.Ссылка КАК Тип,
	            |	ТипыПрикрепленныхДокументов.Наименование КАК Наименование
	            |ИЗ
	            |	Справочник.ТипыПрикрепленныхДокументов.ДоступностьПоТипамЗаказов КАК ТипыПрикрепленныхДокументовДоступностьПоТипамЗаказов
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыПрикрепленныхДокументов КАК ТипыПрикрепленныхДокументов
	            |		ПО ТипыПрикрепленныхДокументовДоступностьПоТипамЗаказов.Ссылка = ТипыПрикрепленныхДокументов.Ссылка
	            |ГДЕ
	            |	ТипыПрикрепленныхДокументовДоступностьПоТипамЗаказов.Доступен = ИСТИНА
	            |	И ТипыПрикрепленныхДокументовДоступностьПоТипамЗаказов.ТипЗаказа = &ТипЗаказа
	            |	И ТипыПрикрепленныхДокументов.ДоступенВыборВМП = ИСТИНА";
	Зап.УстановитьПараметр("ТипЗаказа", Заказ.ТипЗаказа);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Сп = Новый СписокЗначений();
	
	Пока Выб.Следующий() Цикл
		Сп.Добавить(Выб.Тип, Выб.Наименование);
	КонецЦикла;	
	
	Возврат Сп;
КонецФункции
